app/controllers/copies_controller.rb

INSERT INTO "copies" ("business_name", "industry", "target_market", "content", "user_id", "created_at", "updated_at", "copy_location", "copy_purpose", "copy_tone") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
    def create
      @copy = current_user.copies.new(copy_params)
      @copy.content = fetch_openai_content

      if @copy.save

SELECT "copies".* FROM "copies" WHERE "copies"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "copies" WHERE "copies"."id" = $1  [["id", 2]]
---
    def destroy
      @copy = Copy.find(params[:id])
      @copy.destroy