app/controllers/copies_controller.rb

    def create
      @copy = current_user.copies.new(copy_params)

      # prompt = "Create a copy for a business named #{@copy.business_name}, in the #{@copy.industry} industry targeting #{@copy.target_market}."

      prompt = "You are a copywriter for a marketing agency. Write a website copy paragraph for a business named #{@copy.business_name} in the #{@copy.industry} industry. They target #{@copy.target_market}.
      - Location of Use: #{@copy.copy_location}
      - Purpose: #{@copy.copy_purpose}
      - Desired Tone: #{@copy.copy_tone}
      Ensure the copy is clear, concise, and reflects the provided details."

      client = OpenAI::Client.new
      response = client.completions(
        parameters: {
          prompt: prompt,
          max_tokens: 50,
          model: 'curie',
          temperature: 0.2,
      })
      puts response

      @copy.content = response['choices'][0]['text']

      if @copy.save
---
INSERT INTO "copies" ("business_name", "industry", "target_market", "content", "user_id", "created_at", "updated_at", "copy_location", "copy_purpose", "copy_tone") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)